Masmiseim36/nxpSDK/devices/MKW37A4/drivers/fsl_lpuart.c
    return status;
}

/*!
 * brief Aborts the interrupt-driven data receiving.
 *
 * This function aborts the interrupt-driven data receiving. The user can get the remainBytes to find out
 * how many bytes not received yet.
 *
 * param base LPUART peripheral base address.
 * param handle LPUART handle pointer.
 */
void LPUART_TransferAbortReceive(LPUART_Type *base, lpuart_handle_t *handle)
{
    assert(NULL != handle);

    /* Only abort the receive to handle->rxData, the RX ring buffer is still working. */
    if (NULL == handle->rxRingBuffer)
    {
        /* Disable RX interrupt. */
        LPUART_DisableInterrupts(base, (uint32_t)kLPUART_RxDataRegFullInterruptEnable |
                                           (uint32_t)kLPUART_RxOverrunInterruptEnable |
                                           (uint32_t)kLPUART_IdleLineInterruptEnable);
    }

    handle->rxDataSize = 0U;
    handle->rxState    = (uint8_t)kLPUART_RxIdle;
}

/*!
 * brief Gets the number of bytes that have been received.
 *
 * This function gets the number of bytes that have been received.
 *
 * param base LPUART peripheral base address.
 * param handle LPUART handle pointer.
 * param count Receive bytes count.
 * retval kStatus_NoTransferInProgress No receive in progress.
 * retval kStatus_InvalidArgument Parameter is invalid.
 * retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t LPUART_TransferGetReceiveCount(LPUART_Type *base, lpuart_handle_t *handle, uint32_t *count)
{
    assert(NULL != handle);
    assert(NULL != count);

    if ((uint8_t)kLPUART_RxIdle == handle->rxState)
    {
        return kStatus_NoTransferInProgress;
    }

    *count = handle->rxDataSizeAll - handle->rxDataSize;

    return kStatus_Success;
}

static void LPUART_TransferHandleIdleLine(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint8_t count;
    uint8_t tempCount;

#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    count = ((uint8_t)((base->WATER & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT));

    while ((0U != handle->rxDataSize) && (0U != count))
    {
        tempCount = (uint8_t)MIN(handle->rxDataSize, count);

        /* Using non block API to read the data from the registers. */
        LPUART_ReadNonBlocking(base, handle->rxData, tempCount);
        handle->rxData += tempCount;
        handle->rxDataSize -= tempCount;
        count -= tempCount;

        /* If rxDataSize is 0, disable idle line interrupt.*/
        if (0U == (handle->rxDataSize))
        {
            handle->rxState = (uint8_t)kLPUART_RxIdle;

            LPUART_DisableInterrupts(
                base, (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
            if (NULL != handle->callback)
            {
                handle->callback(base, handle, kStatus_LPUART_RxIdle, handle->userData);
            }
        }
    }
#endif
    /* Clear IDLE flag.*/
    base->STAT |= LPUART_STAT_IDLE_MASK;

    /* If rxDataSize is 0, disable idle line interrupt.*/
    if (0U == handle->rxDataSize)
    {
        LPUART_DisableInterrupts(base, (uint32_t)kLPUART_IdleLineInterruptEnable);
    }
    /* If callback is not NULL and rxDataSize is not 0. */
    if ((0U != handle->rxDataSize) && (NULL != handle->callback))
    {
        handle->callback(base, handle, kStatus_LPUART_IdleLineDetected, handle->userData);
    }
}

static void LPUART_TransferHandleRX(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint8_t count;
    uint8_t tempCount;

/* Get the size that can be stored into buffer for this interrupt. */
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    count = ((uint8_t)((base->WATER & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT));
#else
    count = 1;
#endif

    /* If handle->rxDataSize is not 0, first save data to handle->rxData. */
    while ((0U != handle->rxDataSize) && (0U != count))
    {
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        tempCount = (uint8_t)MIN(handle->rxDataSize, count);
#else
        tempCount = 1;
#endif

        /* Using non block API to read the data from the registers. */
        LPUART_ReadNonBlocking(base, handle->rxData, tempCount);
        handle->rxData += tempCount;
        handle->rxDataSize -= tempCount;
        count -= tempCount;

        /* If all the data required for upper layer is ready, trigger callback. */
        if (0U == handle->rxDataSize)
        {
            handle->rxState = (uint8_t)kLPUART_RxIdle;

            if (NULL != handle->callback)
            {
                handle->callback(base, handle, kStatus_LPUART_RxIdle, handle->userData);
            }
        }
    }

    /* If use RX ring buffer, receive data to ring buffer. */
    if (NULL != handle->rxRingBuffer)
    {
        while (0U != count--)
        {
            /* If RX ring buffer is full, trigger callback to notify over run. */
            if (LPUART_TransferIsRxRingBufferFull(base, handle))
            {
                if (NULL != handle->callback)
                {
                    handle->callback(base, handle, kStatus_LPUART_RxRingBufferOverrun, handle->userData);
                }
            }

            /* If ring buffer is still full after callback function, the oldest data is overridden. */
            if (LPUART_TransferIsRxRingBufferFull(base, handle))
            {
                /* Increase handle->rxRingBufferTail to make room for new data. */
                if (((uint32_t)handle->rxRingBufferTail + 1U) == handle->rxRingBufferSize)
                {
                    handle->rxRingBufferTail = 0U;
                }
                else
                {
                    handle->rxRingBufferTail++;
                }
            }

/* Read data. */
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
            if (handle->isSevenDataBits)
            {
                handle->rxRingBuffer[handle->rxRingBufferHead] = (base->DATA & 0x7F);
            }
            else
            {
                handle->rxRingBuffer[handle->rxRingBufferHead] = base->DATA;
            }
#else
            uint16_t tpmRxRingBufferHead              = handle->rxRingBufferHead;
            uint32_t tpmData                          = base->DATA;
            handle->rxRingBuffer[tpmRxRingBufferHead] = (uint8_t)tpmData;
#endif

            /* Increase handle->rxRingBufferHead. */
            if (((uint32_t)handle->rxRingBufferHead + 1U) == handle->rxRingBufferSize)
            {
                handle->rxRingBufferHead = 0U;
            }
            else
            {
                handle->rxRingBufferHead++;
            }
        }
    }
    /* If no receive requst pending, stop RX interrupt. */
    else if (0U == handle->rxDataSize)
    {
        LPUART_DisableInterrupts(
            base, (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }
    else
    {
    }
}

static void LPUART_TransferHandleTX(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint8_t count;
    uint8_t tempCount;

/* Get the bytes that available at this moment. */
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    count = (uint8_t)FSL_FEATURE_LPUART_FIFO_SIZEn(base) -
            (uint8_t)((base->WATER & LPUART_WATER_TXCOUNT_MASK) >> LPUART_WATER_TXCOUNT_SHIFT);
#else
    count = 1;
#endif

    while ((0U != handle->txDataSize) && (0U != count))
    {
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        tempCount = (uint8_t)MIN(handle->txDataSize, count);
#else
        tempCount = 1;
#endif

