Masmiseim36/nxpSDK/devices/MKW37A4/drivers/fsl_lpuart.c
        /* Using non block API to write the data to the registers. */
        LPUART_WriteNonBlocking(base, handle->txData, tempCount);
        handle->txData += tempCount;
        handle->txDataSize -= tempCount;
        count -= tempCount;

        /* If all the data are written to data register, notify user with the callback, then TX finished. */
        if (0U == handle->txDataSize)
        {
            handle->txState = (uint8_t)kLPUART_TxIdle;

            /* Disable TX register empty interrupt. */
            base->CTRL = (base->CTRL & ~LPUART_CTRL_TIE_MASK);

            /* Trigger callback. */
            if (NULL != handle->callback)
            {
                handle->callback(base, handle, kStatus_LPUART_TxIdle, handle->userData);
            }
        }
    }
}

/*!
 * brief LPUART IRQ handle function.
 *
 * This function handles the LPUART transmit and receive IRQ request.
 *
 * param base LPUART peripheral base address.
 * param handle LPUART handle pointer.
 */
void LPUART_TransferHandleIRQ(LPUART_Type *base, lpuart_handle_t *handle)
{
    assert(NULL != handle);

    uint32_t status            = LPUART_GetStatusFlags(base);
    uint32_t enabledInterrupts = LPUART_GetEnabledInterrupts(base);

    /* If RX overrun. */
    if ((uint32_t)kLPUART_RxOverrunFlag == ((uint32_t)kLPUART_RxOverrunFlag & status))
    {
        /* Clear overrun flag, otherwise the RX does not work. */
        base->STAT = ((base->STAT & 0x3FE00000U) | LPUART_STAT_OR_MASK);

        /* Trigger callback. */
        if (NULL != (handle->callback))
        {
            handle->callback(base, handle, kStatus_LPUART_RxHardwareOverrun, handle->userData);
        }
    }

    /* If IDLE flag is set and the IDLE interrupt is enabled. */
    if ((0U != ((uint32_t)kLPUART_IdleLineFlag & status)) &&
        (0U != ((uint32_t)kLPUART_IdleLineInterruptEnable & enabledInterrupts)))
    {
        LPUART_TransferHandleIdleLine(base, handle);
    }

    /* Receive data register full */
    if ((0U != ((uint32_t)kLPUART_RxDataRegFullFlag & status)) &&
        (0U != ((uint32_t)kLPUART_RxDataRegFullInterruptEnable & enabledInterrupts)))
    {
        LPUART_TransferHandleRX(base, handle);
    }

    /* Send data register empty and the interrupt is enabled. */
    if ((0U != ((uint32_t)kLPUART_TxDataRegEmptyFlag & status)) &&
        (0U != ((uint32_t)kLPUART_TxDataRegEmptyInterruptEnable & enabledInterrupts)))
    {
        LPUART_TransferHandleTX(base, handle);
    }
}

/*!
 * brief LPUART Error IRQ handle function.
 *
 * This function handles the LPUART error IRQ request.
 *
 * param base LPUART peripheral base address.
 * param handle LPUART handle pointer.
 */
void LPUART_TransferHandleErrorIRQ(LPUART_Type *base, lpuart_handle_t *handle)
{
    /* To be implemented by User. */
}
#if defined(FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART0_LPUART1_RX_DriverIRQHandler(void)
{
    uint32_t stat = 0U;
    uint32_t ctrl = 0U;

    if (CLOCK_isEnabledClock(s_lpuartClock[0]))
    {
        stat = LPUART0->STAT;
        ctrl = LPUART0->CTRL;
        if (((LPUART_STAT_OR_MASK & stat) != 0U) ||
            (((LPUART_STAT_RDRF_MASK & stat) != 0U) && ((LPUART_CTRL_RIE_MASK & ctrl) != 0U)) ||
            (((LPUART_STAT_IDLE_MASK & stat) != 0U) && ((LPUART_CTRL_ILIE_MASK & ctrl) != 0U)))
        {
            s_lpuartIsr(LPUART0, s_lpuartHandle[0]);
        }
    }
    if (CLOCK_isEnabledClock(s_lpuartClock[1]))
    {
        stat = LPUART1->STAT;
        ctrl = LPUART1->CTRL;
        if (((LPUART_STAT_OR_MASK & stat) != 0U) ||
            (((LPUART_STAT_RDRF_MASK & stat) != 0U) && ((LPUART_CTRL_RIE_MASK & ctrl) != 0U)) ||
            (((LPUART_STAT_IDLE_MASK & stat) != 0U) && ((LPUART_CTRL_ILIE_MASK & ctrl) != 0U)))
        {
            s_lpuartIsr(LPUART1, s_lpuartHandle[1]);
        }
    }
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
void LPUART0_LPUART1_TX_DriverIRQHandler(void)
{
    uint32_t stat = 0U;
    uint32_t ctrl = 0U;

    if (CLOCK_isEnabledClock(s_lpuartClock[0]))
    {
        stat = LPUART0->STAT;
        ctrl = LPUART0->CTRL;
        if ((LPUART_STAT_OR_MASK & stat) || ((stat & LPUART_STAT_TDRE_MASK) && (ctrl & LPUART_CTRL_TIE_MASK)))
        {
            s_lpuartIsr(LPUART0, s_lpuartHandle[0]);
        }
    }
    if (CLOCK_isEnabledClock(s_lpuartClock[1]))
    {
        stat = LPUART1->STAT;
        ctrl = LPUART1->CTRL;
        if ((LPUART_STAT_OR_MASK & stat) || ((stat & LPUART_STAT_TDRE_MASK) && (ctrl & LPUART_CTRL_TIE_MASK)))
        {
            s_lpuartIsr(LPUART1, s_lpuartHandle[1]);
        }
    }
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
#else
void LPUART0_LPUART1_DriverIRQHandler(void)
{
    uint32_t stat = 0U;
    uint32_t ctrl = 0U;

    if (CLOCK_isEnabledClock(s_lpuartClock[0]))
    {
        stat = LPUART0->STAT;
        ctrl = LPUART0->CTRL;
        if ((0U != (LPUART_STAT_OR_MASK & stat)) ||
            ((0U != (LPUART_STAT_RDRF_MASK & stat)) && (0U != (LPUART_CTRL_RIE_MASK & ctrl))) ||
            ((0U != (LPUART_STAT_TDRE_MASK & stat)) && (0U != (LPUART_CTRL_TIE_MASK & ctrl))) ||
            ((0U != (LPUART_STAT_IDLE_MASK & stat)) && (0U != (LPUART_CTRL_ILIE_MASK & ctrl))))
        {
            s_lpuartIsr(LPUART0, s_lpuartHandle[0]);
        }
    }
    if (CLOCK_isEnabledClock(s_lpuartClock[1]))
    {
        stat = LPUART1->STAT;
        ctrl = LPUART1->CTRL;
        if ((0U != (LPUART_STAT_OR_MASK & stat)) ||
            ((0U != (LPUART_STAT_RDRF_MASK & stat)) && (0U != (LPUART_CTRL_RIE_MASK & ctrl))) ||
            ((0U != (LPUART_STAT_TDRE_MASK & stat)) && (0U != (LPUART_CTRL_TIE_MASK & ctrl))) ||
            ((0U != (LPUART_STAT_IDLE_MASK & stat)) && (0U != (LPUART_CTRL_ILIE_MASK & ctrl))))
        {
            s_lpuartIsr(LPUART1, s_lpuartHandle[1]);
        }
    }
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
#endif
#endif

